tnt310/STM32-E407-ETHERNET-MODBUS-MASTER/Src/modbus_mqtt_bridge.c
	}
}

data1_t *parse_device(char *Buffer, uint16_t BufferLen)
{
	ptr = &test;
	int r;
	jsmn_parser p;
	jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
	jsmn_init(&p);
	r = jsmn_parse(&p, Buffer,BufferLen, t,sizeof(t) / sizeof(t[0]));
	for (uint8_t i = 1; i < r; i++) {
		if (jsoneq(Buffer, &t[i], "PORT") == 0) {
			ptr->channel = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "ID") == 0) {
			ptr->deviceID = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "FC") == 0) {
			ptr->func = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNEL") == 0) {
			memset(temp0,'\0',sizeof(temp0));
			strncpy(temp0,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceChannel = (uint16_t)strtol(temp0, NULL, 0);
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICETYPE") == 0) {
			memset(temp,'\0',sizeof(temp));
			strncpy(temp,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceType = temp;
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICENAME") == 0) {
			memset(temp1,'\0',sizeof(temp));
			strncpy(temp1,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->deviceName = temp1;
			i++;
		} else if (jsoneq(Buffer, &t[i], "CHANNELTITLE") == 0) {
			memset(temp2,'\0',sizeof(temp2));
			strncpy(temp2,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->channeltitle = temp2;
			i++;
		}else if (jsoneq(Buffer, &t[i], "VALUETYPE") == 0) {
			memset(temp3,'\0',sizeof(temp3));
			strncpy(temp3,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->valueType= temp3;
			i++;
		}else if (jsoneq(Buffer, &t[i], "NUMREG") == 0) {
			ptr->numreg = (uint8_t)atoi(Buffer + t[i + 1].start);
			i++;
		}else if (jsoneq(Buffer, &t[i], "SCALE") == 0) {
			ptr->scale = (uint16_t)atoi(Buffer + t[i + 1].start);
			i++;
		} else if (jsoneq(Buffer, &t[i], "DEVICESTATUS") == 0) {
			ptr->devicestatus = atoi(Buffer + t[i + 1].start);
			i++;
		}else if (jsoneq(Buffer, &t[i], "REGTYPE") == 0) {
			memset(regtype,'\0',sizeof(regtype));
			strncpy(regtype,Buffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
			ptr->regtype = regtype;
			i++;
			if (strstr(regtype,"UINT16") != NULL || strstr(regtype,"INT16") != NULL){
				ptr->numreg = 1;
				//printf("\r\n Reg Type : %s with num_reg: %d \r\n",regtype, ptr->numreg);
			}else if (strstr(regtype,"INT32") != NULL || strstr(regtype,"UINT32") != NULL || strstr(regtype,"FLOAT32") != NULL){
				ptr->numreg = 2;
				//printf("\r\n Reg Type : %s with num_reg: %d \r\n",regtype, ptr->numreg);
			}
		}
	}
	return ptr;
}

void addDevice(data1_t *destination, data1_t *data)
{
   destination->channel = data->channel;
   destination->deviceID = data->deviceID;
   destination->func = data->func;
   destination->devicestatus = data->devicestatus;
   destination->numreg = data->numreg;
   destination->scale = data->scale;
   destination->deviceChannel = data->deviceChannel;
   destination->deviceType = allocate(data->deviceType);
   destination->deviceName = allocate(data->deviceName);
   destination->channeltitle = allocate(data->channeltitle);
   destination->valueType = allocate(data->valueType);
   destination->regtype = allocate(data->regtype);
}

/*---------------------------------------------------MODBUS MQTT BRIGDE FUNCTION-----------------------------------------------------------------------------*/
static void mqtt_bridge_pub_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish telemetry result: %d\n", result);
	} else {
	}
}
static void mqtt_bridge_provision_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish provision result: %d\n", result);
	} else {
	}
}
static void mqtt_bridge_time_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish time result: %d\n", result);
	} else {
	}
}
static void mqtt_bridge_command_request_cb(void *arg, err_t result) {
	if (result != ERR_OK) {
		printf("\r\n Publish command result: %d\n", result);
	} else {
	}
}
/*----------------------------------------------------UP/DOWNLINK FUNCTION--------------------------------------------------------------------------*/
void mqtt_modbus_thread_up(mqtt_client_t *client, char *pub_topic, char* pro_topic, char* command_topic, char *time_topic) {

	char *hello_server = "{time}";
	mqtt_publish(client,time_topic,hello_server,strlen(hello_server), QOS_0, 0,mqtt_bridge_time_request_cb,NULL);
	uint8_t time[6];
	static uint8_t counter = 0;
	static uint8_t telemetry = 0;
	BaseType_t Err = pdFALSE;
	xQueueMbMqtt_t xQueueMbMqtt;
	portCHAR head[MAX_JSON_LEN];
	portCHAR tail[MAX_JSON_LEN];
	portCHAR jsontemp[TEMP_JSON_LEN];
	portCHAR jsontempv1[TEMP_JSON_LEN];
	memset(head,'\0',sizeof(head));
	memset(tail,'\0',sizeof(tail));
	static uint8_t count = 0;
	err_t err;
	while (1) {
		Err = xQueueReceive(xQueueUplinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME*3);
		if (Err == pdPASS) {
			if (xQueueMbMqtt.gotflagProvision == 2){
					err_t err;
					uint8_t SUM = xQueueMbMqtt.sum_dev;
				    for (uint8_t i = 0; i < SUM; i++)// duyệt từng phần tử trong mảng
				    {
				        for (uint8_t j = 0; j < SUM; j++)  // duyệt ID device
				        {
				            if ((dynamic+j)->deviceID == (dynamic+i)->deviceID && (dynamic+i)->deviceID != (dynamic+i-1)->deviceID){
				                    count ++;
				                    if (count == 1){
				                        if (i > 0){
				                        for (uint8_t a = 0; a < i; a++){
				                             if ((dynamic+a)->deviceID == (dynamic+j)->deviceID){
				                                goto TEST;
				                                }
				                            }
				                        }
				                        head_provision(head,(dynamic+j)->deviceID,(dynamic+j)->deviceName,(dynamic+j)->deviceType);
				                        for (uint8_t z = 0; z < SUM; z++)  // duyệt channel ID
				                        {
				                            if ((dynamic+z)->deviceID == (dynamic+j)->deviceID){
				                            	tail_provision(tail,(dynamic+z)->deviceChannel,(dynamic+z)->channeltitle,(dynamic+z)->valueType, (dynamic+z)->func);
				                                strcat(head,tail);
				                            }
				                        }
				                        head[strlen(head) - 1] = '\0';
				                        strcat(head,"]}]}");
				                        printf("\r\n Lenght of provision: %d\r\n", strlen(head));
				                        err = mqtt_publish(client,pro_topic, head,strlen(head), QOS_0, 0,mqtt_bridge_provision_request_cb,NULL);
				                        memset(head,'\0',sizeof(head));
				                        memset(tail,'\0',sizeof(tail));
										if (err != ERR_OK) {
											printf("\r\n Publish Provision err: %d\n", err);
											}else if (err == ERR_OK){
												HAL_Delay(200);
												status++;
											}
				                    }
				            }
				        }
				        TEST: count = 0;
				    }
//					BaseType_t Er = pdFALSE;
//					#define portDEFAULT_WAIT_TIME 1000
//					xQueueMbMqtt.gotflagProvision = 3;
//					Err = xQueueSend(xQueueUplinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME);
//						if (Err == pdPASS) {
//							xQueueMbMqtt.gotflagProvision = 0;
//						}else {
//							printf("\r\n End Provvision Up queued: False \r\n");
//						}
				}else if (xQueueMbMqtt.gotflagcommand == 3){  // check command
				if (xQueueMbMqtt.FunC == 3){
					if (xQueueMbMqtt.flag32 == 1){  // U32, I32
						xQueueMbMqtt.flag32 = 0;
						if (xQueueMbMqtt.gotflagvalue == 0){
						    memset(res,'\0',sizeof(res));
						    memset(ftoastr,'\0',sizeof(ftoastr));
							sprintf(res,"%d",xQueueMbMqtt.RegData32.i32data);
							ftoa(ftoastr, res, xQueueMbMqtt.scale);
							command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
						}else if (xQueueMbMqtt.gotflagvalue == 1){
						    memset(res,'\0',sizeof(res));
						    memset(ftoastr,'\0',sizeof(ftoastr));
							sprintf(res,"%d",xQueueMbMqtt.IRegData32.i32data);
							ftoa(ftoastr, res, xQueueMbMqtt.scale);
							command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
						}else if (xQueueMbMqtt.gotflagvalue == 2){
						    memset(res,'\0',sizeof(res));
						    memset(ftoastr,'\0',sizeof(ftoastr));
						    FloatToString(res,xQueueMbMqtt.RegData32.i32data);
							ftoa(ftoastr, res, xQueueMbMqtt.scale);
							command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
						}
					}else{   // U16, I16
						if (xQueueMbMqtt.gotflagvalue == 0){
						    memset(res,'\0',sizeof(res));
						    memset(ftoastr,'\0',sizeof(ftoastr));
							sprintf(res,"%d",xQueueMbMqtt.RegData.i16data);
							ftoa(ftoastr, res, xQueueMbMqtt.scale);
							command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
						}else if (xQueueMbMqtt.gotflagvalue == 1){
						    memset(res,'\0',sizeof(res));
						    memset(ftoastr,'\0',sizeof(ftoastr));
							sprintf(res,"%d",xQueueMbMqtt.IRegData.i16data);
							ftoa(ftoastr, res, xQueueMbMqtt.scale);
							command_read_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data,ftoastr);
						}
					}
				}
				else if (xQueueMbMqtt.FunC == 6){
					command_write_json(head, xQueueMbMqtt.NodeID, xQueueMbMqtt.RegAdr.i16data);
				}
				err = mqtt_publish(client,command_topic, head,strlen(head), QOS_0, 0,mqtt_bridge_command_request_cb,NULL);
				if (err != ERR_OK) {
					printf("\r\n Publish command err: %d\n", err);
					}
				else if (err == ERR_OK){
					xQueueMbMqtt.gotflagcommand = 0;
				}
			}else if (xQueueMbMqtt.gotflagLast == 1){ // send record data
				MX_FATFS_Init();
				fresult = f_mount(&fs, "/", 1);
				fresult = f_open(&fil,"record.txt", FA_READ);
				for (uint8_t i= 0; (f_eof(&fil) == 0); i++)
					{
						memset(head,'\0',sizeof(head));
						f_gets((char*)head, sizeof(head), &fil);
						head[strlen(head)-1] = '\0';
						HAL_Delay(200);
						//printf("\r\n Telemetry buffer: %s\r\n",record);
						err = mqtt_publish(client, pub_topic,head,strlen(head), QOS_0, 0,mqtt_bridge_pub_request_cb,NULL);
						if (err != ERR_OK){
							printf("\r\n Publish record fail with err: %d", err);
						}
					}
				fresult = f_unlink("record.txt");
				fresult = f_open(&fil,"record.txt", FA_CREATE_ALWAYS);
				fresult = f_close(&fil);
			}else if (xQueueMbMqtt.gotflagLast == 2) {   // telemetry
				getTime(time);
				timestamp_telemetry(head,time);
				tail[strlen(tail) - 1] = '\0';
				strcat(tail,"}}}");
				strcat(head,tail);
				printf("\r\n Lenght of telemetry: %d\r\n",strlen(head));
				err = mqtt_publish(client, pub_topic,head,strlen(head), QOS_0, 0,mqtt_bridge_pub_request_cb,NULL);
				if (err != ERR_OK) {
					printf("\r\n Publish err: %d\n", err);
					if (err == -11){
						strcat(head,"\n");
						RecordData("record.txt",head);// write data to record.txt
						//MX_LWIP_Init();
					}else if (err == -1){
						strcat(head,"\n");
						RecordData("record.txt",head);// write data to record.txt
						// do something for err : out of memory
					}
					memset(head,'\0',sizeof(head));
					memset(tail,'\0',sizeof(tail));
					counter = 0;
				}else if (err == ERR_OK)
					done ++;
				memset(head,'\0',sizeof(head));
				memset(tail,'\0',sizeof(tail));
				counter = 0;
			}
			else if (xQueueMbMqtt.gotflagtelemetry == 2) {
				if (xQueueMbMqtt.flag32 == 1){
					xQueueMbMqtt.flag32 = 0;
					if (xQueueMbMqtt.gotflagvalue == 0){
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.RegData32.i32data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						printf("\r\nTelemetry data regU32: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
					}else if(xQueueMbMqtt.gotflagvalue == 1){
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.IRegData32.i32data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						printf("\r\nTelemetry data regI32: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
					}else if(xQueueMbMqtt.gotflagvalue == 2){
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
					    FloatToString(res,xQueueMbMqtt.RegData32.i32data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						printf("\r\nTelemetry data Float32: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
					}
				}else if (xQueueMbMqtt.flag64 == 1){
					xQueueMbMqtt.flag64 = 0;
				    memset(res,'\0',sizeof(res));
				    memset(ftoastr,'\0',sizeof(ftoastr));
				    char *s = itoa_user(xQueueMbMqtt.RegData64.i64data, 10);
					//sprintf(res,"%d",xQueueMbMqtt.RegData64.i64data);
					ftoa(ftoastr, itoa_user(xQueueMbMqtt.RegData64.i64data, 10), 10);
					printf("\r\nTelemetry data reg64: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
				}else{
					if (xQueueMbMqtt.gotflagvalue == 0){
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.RegData.i16data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						printf("\r\nTelemetry data regU16: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
					}else if (xQueueMbMqtt.gotflagvalue == 1){
					    memset(res,'\0',sizeof(res));
					    memset(ftoastr,'\0',sizeof(ftoastr));
						sprintf(res,"%d",xQueueMbMqtt.IRegData.i16data);
						ftoa(ftoastr, res, xQueueMbMqtt.scale);
						printf("\r\nTelemetry data regI16: %d \t %d \t %s\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data ,ftoastr);
					}
				}
			counter ++;
			if (counter == 1) {
				id_temp[0] = xQueueMbMqtt.NodeID;
				head_telemetry(jsontemp, xQueueMbMqtt.NodeID);
				strcat(tail,jsontemp);
				if (telemetry == 1){
					strcat(tail,jsontempv1);
					telemetry = 0;
				}
				tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data, ftoastr);
				strcat(tail,jsontemp);
			}
			if (counter > 1){
				id_temp[1] = xQueueMbMqtt.NodeID;
				if (id_temp[0] == id_temp[1]) {
					tail_telemetry(jsontemp,xQueueMbMqtt.RegAdr.i16data,ftoastr);
					strcat(tail,jsontemp);
				}
				else if (id_temp[0] != id_temp[1]){
					telemetry = 1;
					counter = 0;
					tail_telemetry(jsontempv1,xQueueMbMqtt.RegAdr.i16data, ftoastr);
					tail[strlen(tail) - 1] = '\0';
					strcat(tail,"},");
				}
			}
		}/* --------------END OF SENDING TELEMETRY--------------------------------------------------------------------*/
	} else {
			/*Create Json and publish to mqtt */
//			memset(publish_buffer, 0, MAX_JSON_LEN);
//			strcat(publish_buffer, "{\"NodeID\":");
//			strcat(publish_buffer, itoa_user(0, 10));
//			strcat(publish_, ",\"FunC\":");
//			strcat(publish_buffer, itoa_user(MB_FUNC_ACK, 10));
//			strcat(publish_buffer, ",\"RegAdrH\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegAdr.i8data[1], 10));
//			strcat(publish_buffer, ",\"RegAdrL\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegAdr.i8data[0], 10));
//			strcat(publish_buffer, ",\"RegDataH\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegData.i8data[1], 10));
//			strcat(publish_buffer, ",\"RegDataL\":");
//			strcat(publish_buffer,
//					itoa_user(xQueueMbMQtt.RegData.i8data[0], 10));
//			strcat(publish_buffer, ",\"PortID\":");
//			strcat(publish_buffer, itoa_user(xQueueMbMQtt.PortID, 10));
//			strcat(publish_buffer, "}");
////			HAL_UART_Transmit(&huart1, publish_buffer, MAX_JSON_LEN, 1000);
//			err = mqtt_publish(client, pub_topic, publish_buffer,
//					strlen(publish_buffer), QOS_0, 0,
//					mqtt_bridge_pub_request_cb,
//					NULL);
//			if (err != ERR_OK) {
//				mqtt_couter_err++;
//
//				printf("\r\n Publish err: %d\n", err);
//				if (mqtt_couter_err == 10) NVIC_SystemReset();
//			}
//			else
//			{
//				mqtt_couter_err = 0;
//			}

