tnt310/STM32-E407-ETHERNET-MODBUS-MASTER/Src/modbus_mqtt_bridge.c
		}
//		vTaskDelay(10);

	}
}
//	how to got mqtt intance??
/*-------------------------------------PROVISION DOWNSTREAM AND COMMAND DOWNSTREAM---------------------------------------------------------------------------------------*/
uint8_t mqtt_modbus_thread_down_provision(char *Buffer,uint16_t BufferLen) {

	uint8_t deviceID, channelStatus, temp;
	uint16_t channelID;
	int r;
	uint16_t value = 0;
	jsmn_parser p;
	jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
	jsmn_init(&p);
	xQueueMbMqtt_t xQueueMbMqtt;
	r = jsmn_parse(&p, Buffer, BufferLen, t,sizeof(t) / sizeof(t[0]));
	if (r < 0) {
		printf("Failed to parse JSON: %d\n", r);
		return 1;
	}
	/* Assume the top-level element is an object */
	if (r < 1 || t[0].type != JSMN_OBJECT) {
		printf("Object expected\n");
		return 1;
	}
		for (uint8_t i = 0; i < r - 1; i++) {
			if (i == 2){
				deviceID = atoi(Buffer + t[i + 1].start);
			}else if (i == 4){
				for (uint8_t j = i; j < r-1; j++){
					if(j % 2 == 0){
						channelID = (uint16_t)atoi(Buffer + t[j + 1].start);
					}
					else if (j %2 != 0){
						channelStatus = atoi(Buffer + t[j + 1].start);
						for (uint8_t z =0; z <num_device ; z++){
							if (deviceID == (dynamic+z)->deviceID && channelID == (dynamic+z)->deviceChannel){
								channelStatus = atoi(Buffer + t[j + 1].start);;
								(dynamic+z)->devicestatus = channelStatus;
							}
						}
						printf("\r\n - deviceID %d \t channelID: %d \t channelstatus: %d\r\n",deviceID,channelID,channelStatus);
					}
				}
			}
		}
}
uint8_t mqtt_modbus_thread_down_command(char *pJsonMQTTBuffer,uint16_t pJsonMQTTBufferLen) {

		int r;
		uint16_t value = 0;
		jsmn_parser p;
		jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
		jsmn_init(&p);
		xQueueMbMqtt_t xQueueMbMqtt;
		r = jsmn_parse(&p, pJsonMQTTBuffer, pJsonMQTTBufferLen, t,sizeof(t) / sizeof(t[0]));
		if (r < 0) {
			printf("Failed to parse JSON: %d\n", r);
			return 1;
		}
		/* Assume the top-level element is an object */
		if (r < 1 || t[0].type != JSMN_OBJECT) {
			printf("Object expected\n");
			return 1;
		}
		for (uint8_t i = 1; i < r; i++) {
			if (jsoneq(pJsonMQTTBuffer, &t[i], "device_id") == 0) {
				xQueueMbMqtt.NodeID = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "channel_id") == 0) {
				xQueueMbMqtt.RegAdr.i16data = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "command") == 0) {
				char cmd[20];
				strncpy(cmd, pJsonMQTTBuffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
				if (strstr(cmd,"read") != NULL){
					xQueueMbMqtt.FunC = 3;
				}
				else if (strstr(cmd,"write") != NULL){
					xQueueMbMqtt.FunC = 6;
					i++;
				}
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "value") == 0) {
				char val[10];
				strncpy(val, pJsonMQTTBuffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
				if (strstr(val,"true") != NULL || strstr(val,"on") != NULL)
					value = 1;
				else if (strstr(val,"false") != NULL || strstr(val,"off") != NULL)
					value = 0;
				else
					value = atoi(pJsonMQTTBuffer + t[i + 1].start);
				xQueueMbMqtt.RegData.i8data[0] = (uint8_t)value;
				xQueueMbMqtt.RegData.i8data[1] = (uint8_t)(value >> 8);
				i++;
			}
		}
		xQueueMbMqtt.PortID = 0;
		printf("\r\n command: %d\t%d\t%d\t%d\r\n",xQueueMbMqtt.NodeID,xQueueMbMqtt.RegAdr.i16data,xQueueMbMqtt.FunC,xQueueMbMqtt.RegData.i16data);
		BaseType_t Err = pdFALSE;
		Err = xQueueSend(xQueueDownlinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME);
		if (Err == pdPASS) {
			//memset(pJsonMQTTBuffer,'\0',pJsonMQTTBufferLen);
		} else {
			printf("\r\n Modbus_MQTT Downlink queued: False \r\n");
		}
}
uint8_t mqtt_modbus_thread_down_time(char *pJsonMQTTBuffer,uint16_t pJsonMQTTBufferLen){
	/*Parsing json by using clone source :) */
		int i;
		int r;
		jsmn_parser p;
		jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
		jsmn_init(&p);
		xQueueMbMqtt_t xQueueMbMqtt;
		RTC_TimeTypeDef sTime = { 0 };
		RTC_DateTypeDef sDate = { 0 };
		r = jsmn_parse(&p, pJsonMQTTBuffer, pJsonMQTTBufferLen, t,
				sizeof(t) / sizeof(t[0]));
		if (r < 0) {
			printf("Failed to parse JSON: %d\n", r);
			return 1;
		}
		/* Assume the top-level element is an object */
		if (r < 1 || t[0].type != JSMN_OBJECT) {
			printf("Object expected\n");
			return 1;
		}
		/* Loop over all keys of the root object */
		for (i = 1; i < r; i++) {
			if (jsoneq(pJsonMQTTBuffer, &t[i], "year") == 0) {
				printf("\r\n -year: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sDate.Year  = atoi(pJsonMQTTBuffer + t[i + 1].start) - 2000;
				i++;
			} else if (jsoneq(pJsonMQTTBuffer, &t[i], "month") == 0) {
				/* We may additionally check if the value is either "true" or "false" */
				printf("\r\n - month: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sDate.Month = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			} else if (jsoneq(pJsonMQTTBuffer, &t[i], "day") == 0) {
				/* We may additionally check if the value is either "true" or "false" */
				printf("\r\n - day: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sDate.Date  = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			} else if (jsoneq(pJsonMQTTBuffer, &t[i], "hour") == 0) {
				/* We may additionally check if the value is either "true" or "false" */
				printf("\r\n - hour: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sTime.Hours = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			} else if (jsoneq(pJsonMQTTBuffer, &t[i], "minute") == 0) {
				/* We may additionally check if the value is either "true" or "false" */
				printf("\r\n - minute: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sTime.Minutes = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			} else if (jsoneq(pJsonMQTTBuffer, &t[i], "second") == 0) {
				/* We may additionally check if the value is either "true" or "false" */
				printf("\r\n - second: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				sTime.Seconds = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			}
		}
		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) {
			printf("BUGGGGG");
			Error_Handler();
		}
		if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) {
			printf("BUGGGGG");
			Error_Handler();
		}
		__HAL_RCC_RTC_ENABLE();
		printf("\r\n Time: %d %d %d %d %d %d \r\n", sDate.Year,sDate.Month,sDate.Date, sTime.Hours, sTime.Minutes,sTime.Seconds);
}

